meeting/agenda/2024/02-27.org
:PROPERTIES:
:ID:       BBB004CD-629B-4CF8-95E0-A85C35D9E184
:END:
#+title: QT4 CG Meeting 067 Agenda 2024-02-27
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EST, 08:00PST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets SF, DN, perhaps WP.

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/02-20.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 27 February. The following meeting is
scheduled for 5 March.

Any regrets for 5 March 2024?

** Review of open action items [1/11]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”
+ [ ] QT4CG-056-04: MK to write a proposal for adding a select attribute to xsl:text
+ [ ] QT4CG-058-02: MK to consider providing more advice about the pitfalls of mixing decimal and double when sorting
+ [ ] QT4CG-063-01: MK to revise #956 especially with respect to the options parameter
+ [ ] QT4CG-063-02: JK to consider whether the roman numeral example is appropriate for the spec.
+ [ ] QT4CG-063-04: NW to try to add test review to the editorial meeting.
+ [ ] QT4CG-063-05: MK to revise PR #953 to take account of CG’s comments
+ [ ] QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record
+ [ ] QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.
+ [X] QT4CG-065-01: CG to amend PR #795 to address MK’s comment re: implementation defined behavior
+ [ ] QT4CG-066-01: MK to add a note that the grammar rules for regular expressions apply after comments are removed

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-956][#956]]: 850-partial Editorial improvements to parse-html()
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1034][#1034]]: QT4CG-066-xx Add note regarding absence of drop-while / skip-while
+ PR [[https://qt4cg.org/dashboard/#pr-1033][#1033]]: QT4CG-066-01 Add note that whitespace and comments in regexen are lexical constructs
+ PR [[https://qt4cg.org/dashboard/#pr-1032][#1032]]: 1029 Make argument of fn:void optional
+ PR [[https://qt4cg.org/dashboard/#pr-1031][#1031]]: 1024 Change precedence of 'otherwise' operator

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1030][#1030]]: allow pattern matches in axis expression
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1007][#1007]]: How to invert a predicate function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/990][#990]]: Transitive closure on non-nodes
+ Issue [[https://github.com/qt4cg/qtspecs/issues/872][#872]]: Symmetry: fn:items-at → fn:get
+ Issue [[https://github.com/qt4cg/qtspecs/issues/843][#843]]: Standard, array & map functions: Equivalencies
+ Issue [[https://github.com/qt4cg/qtspecs/issues/825][#825]]: array:members-at
+ Issue [[https://github.com/qt4cg/qtspecs/issues/356][#356]]: array:leaves

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-921][#921]]: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch
+ PR [[https://qt4cg.org/dashboard/#pr-871][#871]]: Action qt4 cg 027 01 next match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1042][#1042]]: 1016 Editorial cleanup - csv-to-arrays
+ PR [[https://qt4cg.org/dashboard/#pr-1041][#1041]]: 236 map:build: sequence of keys
+ PR [[https://qt4cg.org/dashboard/#pr-1040][#1040]]: 485 Predeclared namespaces in XQuery: output
+ PR [[https://qt4cg.org/dashboard/#pr-1027][#1027]]: 150 fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1015][#1015]]: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes
+ PR [[https://qt4cg.org/dashboard/#pr-1003][#1003]]: 919 Use EBV in boolean callbacks
+ PR [[https://qt4cg.org/dashboard/#pr-988][#988]]: 960 Pinned and labeled values
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/910][#910]]: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/908][#908]]: Function identity: documentation still too vague
+ Issue [[https://github.com/qt4cg/qtspecs/issues/882][#882]]: fn:chain or fn:compose
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/829][#829]]: fn:boolean: EBV support for more item types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/557][#557]]: fn:unparsed-binary: accessing and manipulating binary types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]]: fn:format-number: Specifying decimal format
+ Issue [[https://github.com/qt4cg/qtspecs/issues/283][#283]]: Enumeration types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: JSON Parsing & Serialization: Numbers
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #1003: 919 Use EBV in boolean callbacks
:PROPERTIES:
:CUSTOM_ID: pr-1003
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1003][#1003]]

** PR #1042: 1016 Editorial cleanup - csv-to-arrays
:PROPERTIES:
:CUSTOM_ID: pr-1042
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1042][#1042]]

** PR #1041: 236 map:build: sequence of keys
:PROPERTIES:
:CUSTOM_ID: pr-1041
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1041][#1041]]

** PR #1040: 485 Predeclared namespaces in XQuery: output
:PROPERTIES:
:CUSTOM_ID: pr-1040
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1040][#1040]]

** PR #988: 960 Pinned and labeled values
:PROPERTIES:
:CUSTOM_ID: pr-988
:END:

See PR [[https://qt4cg.org/dashboard/#pr-988][#988]]

** PR #953: 617 Define record constructors
:PROPERTIES:
:CUSTOM_ID: pr-953
:END:

See PR [[https://qt4cg.org/dashboard/#pr-953][#953]]

** PR #832: 77 Add map:deep-update and array:deep-update
:PROPERTIES:
:CUSTOM_ID: h-F3632628-923E-45C0-8B96-E4AB44293D5C
:END:

See PR [[https://qt4cg.org/dashboard/#pr-832][#832]]



* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
