meeting/agenda/2024/02-27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 067 Agenda 2024-02-27</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 067 Agenda 2024-02-27</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EST, 08:00PST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets SF, DN, perhaps WP.
</p>
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/02-20.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 27 February. The following meeting is
scheduled for 5 March.
</p>

<p>
Any regrets for 5 March 2024?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/11]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-056-04: MK to write a proposal for adding a select attribute to xsl:text</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-058-02: MK to consider providing more advice about the pitfalls of mixing decimal and double when sorting</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-01: MK to revise #956 especially with respect to the options parameter</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-02: JK to consider whether the roman numeral example is appropriate for the spec.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-04: NW to try to add test review to the editorial meeting.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-05: MK to revise PR #953 to take account of CG’s comments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.</li>
<li class="on"><code>[X]</code> QT4CG-065-01: CG to amend PR #795 to address MK’s comment re: implementation defined behavior</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-066-01: MK to add a note that the grammar rules for regular expressions apply after comments are removed</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-956">#956</a>: 850-partial Editorial improvements to parse-html()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1034">#1034</a>: QT4CG-066-xx Add note regarding absence of drop-while / skip-while</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1033">#1033</a>: QT4CG-066-01 Add note that whitespace and comments in regexen are lexical constructs</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1032">#1032</a>: 1029 Make argument of fn:void optional</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1031">#1031</a>: 1024 Change precedence of 'otherwise' operator</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1030">#1030</a>: allow pattern matches in axis expression</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1007">#1007</a>: How to invert a predicate function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/990">#990</a>: Transitive closure on non-nodes</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/872">#872</a>: Symmetry: fn:items-at → fn:get</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/843">#843</a>: Standard, array &amp; map functions: Equivalencies</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/825">#825</a>: array:members-at</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/356">#356</a>: array:leaves</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1042">#1042</a>: 1016 Editorial cleanup - csv-to-arrays</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1041">#1041</a>: 236 map:build: sequence of keys</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1040">#1040</a>: 485 Predeclared namespaces in XQuery: output</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>: 150 fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1003">#1003</a>: 919 Use EBV in boolean callbacks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-988">#988</a>: 960 Pinned and labeled values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.6.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation still too vague</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/882">#882</a>: fn:chain or fn:compose</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/829">#829</a>: fn:boolean: EBV support for more item types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/583">#583</a>: array:replace(), etc</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/340">#340</a>: fn:format-number: Specifying decimal format</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/283">#283</a>: Enumeration types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/33">#33</a>: JSON Parsing &amp; Serialization: Numbers</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-1003" class="outline-3">
<h3 id="pr-1003"><span class="section-number-3">2.1.</span> PR #1003: 919 Use EBV in boolean callbacks</h3>
<div class="outline-text-3" id="text-pr-1003">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1003">#1003</a>
</p>
</div>
</div>

<div id="outline-container-pr-1042" class="outline-3">
<h3 id="pr-1042"><span class="section-number-3">2.2.</span> PR #1042: 1016 Editorial cleanup - csv-to-arrays</h3>
<div class="outline-text-3" id="text-pr-1042">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1042">#1042</a>
</p>
</div>
</div>

<div id="outline-container-pr-1041" class="outline-3">
<h3 id="pr-1041"><span class="section-number-3">2.3.</span> PR #1041: 236 map:build: sequence of keys</h3>
<div class="outline-text-3" id="text-pr-1041">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1041">#1041</a>
</p>
</div>
</div>

<div id="outline-container-pr-1040" class="outline-3">
<h3 id="pr-1040"><span class="section-number-3">2.4.</span> PR #1040: 485 Predeclared namespaces in XQuery: output</h3>
<div class="outline-text-3" id="text-pr-1040">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1040">#1040</a>
</p>
</div>
</div>

<div id="outline-container-pr-988" class="outline-3">
<h3 id="pr-988"><span class="section-number-3">2.5.</span> PR #988: 960 Pinned and labeled values</h3>
<div class="outline-text-3" id="text-pr-988">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-988">#988</a>
</p>
</div>
</div>

<div id="outline-container-pr-953" class="outline-3">
<h3 id="pr-953"><span class="section-number-3">2.6.</span> PR #953: 617 Define record constructors</h3>
<div class="outline-text-3" id="text-pr-953">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-953">#953</a>
</p>
</div>
</div>

<div id="outline-container-h-F3632628-923E-45C0-8B96-E4AB44293D5C" class="outline-3">
<h3 id="h-F3632628-923E-45C0-8B96-E4AB44293D5C"><span class="section-number-3">2.7.</span> PR #832: 77 Add map:deep-update and array:deep-update</h3>
<div class="outline-text-3" id="text-h-F3632628-923E-45C0-8B96-E4AB44293D5C">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>
</p>
</div>
</div>
</div>



<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
